src/cf/src/InformationRegisters/ИзбраннаяНоменклатураРМК/ИзбраннаяНоменклатураРМК.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ИзбраннаяНоменклатураРМК</name>
  <comment>Избранные позиции кассира для быстрого выбора в РМК без сканирования. Ключ - пользователь, номенклатура, характеристика.</comment>
  <resources>
    <name>Порядок</name>
    <comment>Порядок вывода плитки в окне избранного.</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/cf/src/InformationRegisters/ЦеныНоменклатуры/ЦеныНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЦеныНоменклатуры</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Цена</name>
    <type>
      <types>DefinedType.СуммаНеотрицательная</types>
    </type>
  </resources>
  <resources>
    <name>Упаковка</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </resources>
  <dimensions>
    <name>ТоварнаяГруппа</name>
    <type>
      <types>CatalogRef.ТоварныеГруппы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидЦены</name>
    <type>
      <types>CatalogRef.ВидыЦен</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/cf/src/Catalogs/Номенклатура/Номенклатура.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Номенклатура</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ECommerce</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Артикул</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Бренд</name>
    <type>
      <types>CatalogRef.Бренды</types>
    </type>
  </attributes>
  <attributes>
    <name>ВесЕдиница</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>ВесЗнаменатель</name>
    <type>
      <types>DefinedType.КоличествоДолей</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыводитьНаПечатьДатуУпаковки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДекларацияСоответствия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Единица</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>Изображение</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ИзображениеИмяФайла</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Импортер</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьУпаковки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>МаксимальноеКоличествоХранения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МинимальноеКоличествоХранения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаборУпаковок</name>
    <type>
      <types>CatalogRef.НаборыУпаковок</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыводитьНаПечатьОписание</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Производитель</name>
    <type>
      <types>CatalogRef.СтраныМира</types>
    </type>
  </attributes>
  <attributes>
    <name>Сорт</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СрокХранения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтавкаНДС</name>
    <type>
      <types>CatalogRef.СтавкиНДС</types>
    </type>
  </attributes>
  <attributes>
    <name>ТемператураХраненияДо</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТемператураХраненияОт</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТехническийРегламент</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипНоменклатуры</name>
    <type>
      <types>EnumRef.ТипыНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособПополнения</name>
    <type>
      <types>EnumRef.СпособыПополненияЗапасов</types>
    </type>
  </attributes>
  <attributes>
    <name>ТоварнаяГруппа</name>
    <type>
      <types>CatalogRef.ТоварныеГруппы</types>
    </type>
  </attributes>
  <attributes>
    <name>УсловияХранения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Качество</name>
    <type>
      <types>CatalogRef.КачествоТоваров</types>
    </type>
  </attributes>
  <attributes>
    <name>КодСтарый</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЯчейкиСтрокой</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодПоставщика</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодПроизводителя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ТНВЭД</name>
    <type>
      <types>CatalogRef.КодыТНВЭД</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнойПоставщик</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтражатьвЛКП</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Картинка</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>КартинкаРасширение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ТЧСтикеры</name>
    <attributes>
      <name>Контрагент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>СрокХранения</name>
      <type>
        <types>DefinedType.Комментарий</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СвойстваНоменклатуры</name>
    <attributes>
      <name>СвойствоНоменклатуры</name>
      <type>
        <types>CatalogRef.ВидыСвойствНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеСвойства</name>
      <type>
        <types>CatalogRef.ЗначенияСвойствНоменклатуры</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Хранение</name>
    <attributes>
      <name>Зона</name>
      <type>
        <types>CatalogRef.ЯчейкиСклада</types>
      </type>
    </attributes>
    <attributes>
      <name>Склад</name>
      <type>
        <types>CatalogRef.МестаХранения</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТехнологическаяКарта</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>DefinedType.НормаРасхода</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕИ</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СоставКомплекта</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>DefinedType.КоличествоНеотрицательное</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизиты</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизиты</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Станки</name>
    <attributes>
      <name>Станок</name>
      <type>
        <types>CatalogRef.ПроизводственноеОборудование</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/cf/src/InformationRegisters/ИзбраннаяНоменклатураРМК/ManagerModule.bsl
#Область ПрограммныйИнтерфейс

// Проверяет, лежит ли позиция в избранном текущего пользователя.
//
// Параметры:
//  Номенклатура - СправочникСсылка.Номенклатура - проверяемая номенклатура.
//  Характеристика - СправочникСсылка.ХарактеристикиНоменклатуры - характеристика позиции.
//
// Возвращаемое значение:
//  Булево - Истина, если позиция уже в избранном.
//
Функция ЭтоИзбранное(Номенклатура, Характеристика) Экспорт

	Если Не ЗначениеЗаполнено(Номенклатура) Тогда
		Возврат Ложь;
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ИСТИНА КАК Есть
	|ИЗ
	|	РегистрСведений.ИзбраннаяНоменклатураРМК КАК Избранное
	|ГДЕ
	|	Избранное.Пользователь = &Пользователь
	|	И Избранное.Номенклатура = &Номенклатура
	|	И Избранное.Характеристика = &Характеристика";
	Запрос.УстановитьПараметр("Пользователь", ТекущийПользователь());
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("Характеристика", Характеристика);

	Возврат Не Запрос.Выполнить().Пустой();

КонецФункции

// Добавляет позицию в избранное текущего пользователя. Повторное добавление порядок не меняет.
//
// Параметры:
//  Номенклатура - СправочникСсылка.Номенклатура - добавляемая номенклатура.
//  Характеристика - СправочникСсылка.ХарактеристикиНоменклатуры - характеристика позиции.
//
Процедура ДобавитьВИзбранное(Номенклатура, Характеристика) Экспорт

	Если Не ЗначениеЗаполнено(Номенклатура) Или ЭтоИзбранное(Номенклатура, Характеристика) Тогда
		Возврат;
	КонецЕсли;

	Пользователь = ТекущийПользователь();

	// Менеджером записи по полному ключу, а не набором с отбором по пользователю:
	// иначе две параллельные сессии одного кассира затрут список друг друга.
	Запись = РегистрыСведений.ИзбраннаяНоменклатураРМК.СоздатьМенеджерЗаписи();
	Запись.Пользователь = Пользователь;
	Запись.Номенклатура = Номенклатура;
	Запись.Характеристика = Характеристика;
	Запись.Порядок = СледующийПорядок(Пользователь);
	Запись.Записать(Истина);

КонецПроцедуры

// Убирает позицию из избранного текущего пользователя.
//
// Параметры:
//  Номенклатура - СправочникСсылка.Номенклатура - убираемая номенклатура.
//  Характеристика - СправочникСсылка.ХарактеристикиНоменклатуры - характеристика позиции.
//
Процедура УбратьИзИзбранного(Номенклатура, Характеристика) Экспорт

	Если Не ЗначениеЗаполнено(Номенклатура) Тогда
		Возврат;
	КонецЕсли;

	Запись = РегистрыСведений.ИзбраннаяНоменклатураРМК.СоздатьМенеджерЗаписи();
	Запись.Пользователь = ТекущийПользователь();
	Запись.Номенклатура = Номенклатура;
	Запись.Характеристика = Характеристика;
	Запись.Удалить();

КонецПроцедуры

// Возвращает избранное текущего пользователя с ценами для плиток окна быстрого выбора.
//
// Цена считается по виду цен контрагента-розничного клиента и показывается на плитке ровно та,
// которая уйдёт в чек. Ключ регистра цен - четыре измерения (ТоварнаяГруппа, ВидЦены,
// Номенклатура, Характеристика), а товарную группу документы заполняют по-разному
// (УстановкаЦенНоменклатурыВручную не заполняет вовсе), поэтому на одну позицию в срезе
// последних бывает НЕСКОЛЬКО записей: цена сворачивается до одной строки по паре
// номенклатура + характеристика, из записей с самым поздним периодом.
//
// Если цены на пару номенклатура + характеристика нет, берётся цена по одной номенклатуре
// (как её берёт форма подбора FormProduitsOnStock, соединяющая цену только по номенклатуре):
// иначе товар, показанный в подборе с ценой, в избранном оказался бы без цены.
//
// Параметры:
//  ВидЦены - СправочникСсылка.ВидыЦен - вид цен, по которому считается цена плитки.
//
// Возвращаемое значение:
//  ТаблицаЗначений - колонки Номенклатура, Характеристика, Наименование, Цена, Порядок;
//                    по одной строке на позицию избранного.
//
Функция ИзбранноеПользователя(ВидЦены) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Избранное.Номенклатура КАК Номенклатура,
	|	Избранное.Характеристика КАК Характеристика,
	|	Номенклатура.Наименование КАК Наименование,
	|	Избранное.Порядок КАК Порядок
	|ПОМЕСТИТЬ ВТИзбранное
	|ИЗ
	|	РегистрСведений.ИзбраннаяНоменклатураРМК КАК Избранное
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Номенклатура
	|		ПО Избранное.Номенклатура = Номенклатура.Ссылка
	|ГДЕ
	|	Избранное.Пользователь = &Пользователь
	|	И НЕ Номенклатура.ПометкаУдаления
	|	И НЕ Номенклатура.ЭтоГруппа
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Цены.Номенклатура КАК Номенклатура,
	|	Цены.Характеристика КАК Характеристика,
	|	Цены.Цена КАК Цена,
	|	Цены.Период КАК Период
	|ПОМЕСТИТЬ ВТЦеныВсе
	|ИЗ
	|	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(, ВидЦены = &ВидЦены) КАК Цены
	|ГДЕ
	|	Цены.Номенклатура В
	|			(ВЫБРАТЬ
	|				ВТИзбранное.Номенклатура КАК Номенклатура
	|			ИЗ
	|				ВТИзбранное КАК ВТИзбранное)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТЦеныВсе.Номенклатура КАК Номенклатура,
	|	ВТЦеныВсе.Характеристика КАК Характеристика,
	|	МАКСИМУМ(ВТЦеныВсе.Период) КАК Период
	|ПОМЕСТИТЬ ВТПоследниеПериоды
	|ИЗ
	|	ВТЦеныВсе КАК ВТЦеныВсе
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТЦеныВсе.Номенклатура,
	|	ВТЦеныВсе.Характеристика
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТПоследниеПериоды.Номенклатура КАК Номенклатура,
	|	ВТПоследниеПериоды.Характеристика КАК Характеристика,
	|	МАКСИМУМ(ВТЦеныВсе.Цена) КАК Цена
	|ПОМЕСТИТЬ ВТЦенаПоХарактеристике
	|ИЗ
	|	ВТПоследниеПериоды КАК ВТПоследниеПериоды
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТЦеныВсе КАК ВТЦеныВсе
	|		ПО ВТПоследниеПериоды.Номенклатура = ВТЦеныВсе.Номенклатура
	|			И ВТПоследниеПериоды.Характеристика = ВТЦеныВсе.Характеристика
	|			И ВТПоследниеПериоды.Период = ВТЦеныВсе.Период
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТПоследниеПериоды.Номенклатура,
	|	ВТПоследниеПериоды.Характеристика
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТЦенаПоХарактеристике.Номенклатура КАК Номенклатура,
	|	МАКСИМУМ(ВТЦенаПоХарактеристике.Цена) КАК Цена
	|ПОМЕСТИТЬ ВТЦенаПоНоменклатуре
	|ИЗ
	|	ВТЦенаПоХарактеристике КАК ВТЦенаПоХарактеристике
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТЦенаПоХарактеристике.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТИзбранное.Номенклатура КАК Номенклатура,
	|	ВТИзбранное.Характеристика КАК Характеристика,
	|	ВТИзбранное.Наименование КАК Наименование,
	|	ЕСТЬNULL(ВТЦенаПоХарактеристике.Цена, ЕСТЬNULL(ВТЦенаПоНоменклатуре.Цена, 0)) КАК Цена,
	|	ВТИзбранное.Порядок КАК Порядок
	|ИЗ
	|	ВТИзбранное КАК ВТИзбранное
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТЦенаПоХарактеристике КАК ВТЦенаПоХарактеристике
	|		ПО ВТИзбранное.Номенклатура = ВТЦенаПоХарактеристике.Номенклатура
	|			И ВТИзбранное.Характеристика = ВТЦенаПоХарактеристике.Характеристика
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТЦенаПоНоменклатуре КАК ВТЦенаПоНоменклатуре
	|		ПО ВТИзбранное.Номенклатура = ВТЦенаПоНоменклатуре.Номенклатура
	|
	|УПОРЯДОЧИТЬ ПО
	|	Порядок,
	|	Наименование";
	
	Запрос.УстановитьПараметр("Пользователь", ТекущийПользователь());
	Запрос.УстановитьПараметр("ВидЦены", ВидЦены);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

// Возвращает вид цен, по которому РМК показывает цены избранного.
// Повторяет правило формы подбора FormProduitsOnStock: розничный вид цен, а если у
// розничного клиента задан свой тип цены - его.
//
// Возвращаемое значение:
//  СправочникСсылка.ВидыЦен - вид цен для плиток избранного.
//
Функция ВидЦенРМК() Экспорт

	ВидЦены = Справочники.ВидыЦен.Розничная;

	Контрагент = Константы.РозничныйКлиент.Получить();
	Если ЗначениеЗаполнено(Контрагент) И ЗначениеЗаполнено(Контрагент.ТипЦены) Тогда
		ВидЦены = Контрагент.ТипЦены;
	КонецЕсли;

	Возврат ВидЦены;

КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ТекущийПользователь()

	Возврат ПараметрыСеанса.Пользователь;

КонецФункции

Функция СледующийПорядок(Пользователь)

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЕСТЬNULL(МАКСИМУМ(Избранное.Порядок), 0) КАК Порядок
	|ИЗ
	|	РегистрСведений.ИзбраннаяНоменклатураРМК КАК Избранное
	|ГДЕ
	|	Избранное.Пользователь = &Пользователь";
	Запрос.УстановитьПараметр("Пользователь", Пользователь);

	Выборка = Запрос.Выполнить().Выбрать();

	Возврат ?(Выборка.Следующий(), Выборка.Порядок, 0) + 1;

КонецФункции

#КонецОбласти
